In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/home/mtv/Roopsingh/excel_file/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Embarked','Cabin'],axis=1,inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [5]:
target = df.Survived
inputs = df.drop(['Survived'],axis=1)

In [7]:
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [10]:
dummies = pd.get_dummies(inputs.Sex).astype('int8')
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [14]:
inputs = pd.concat([inputs,dummies],axis=1)
inputs

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [15]:
inputs.drop(['Sex'],axis=1,inplace=True)

In [16]:
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [17]:
inputs['Age'].isna().sum()

177

In [19]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [20]:
inputs.Age.fillna(inputs.Age.mean(),inplace=True)

In [21]:
inputs.Age.isna().sum()

0

In [31]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [24]:
len(X_train)

712

In [25]:
len(X_test)

179

In [32]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [33]:
model.fit(X_train,y_train)

GaussianNB()

In [34]:
model.score(X_test,y_test)

0.7988826815642458

In [35]:
y_test[:10]

433    0
824    0
259    1
406    0
563    0
437    1
63     0
91     0
377    0
518    1
Name: Survived, dtype: int64

In [36]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 0, 1, 0, 0, 1, 1])

In [37]:
model.predict_proba(X_test[:10])

array([[9.86676219e-01, 1.33237806e-02],
       [9.75095563e-01, 2.49044370e-02],
       [3.57199731e-02, 9.64280027e-01],
       [9.90683041e-01, 9.31695878e-03],
       [9.89562587e-01, 1.04374131e-02],
       [3.01405772e-02, 9.69859423e-01],
       [9.80008942e-01, 1.99910582e-02],
       [9.87601164e-01, 1.23988364e-02],
       [1.39211274e-05, 9.99986079e-01],
       [3.41437770e-02, 9.65856223e-01]])